app/controllers/features_controller.rb

  def show
    @feature = Feature.find(params[:feature_id] || params[:id])
---
SELECT * FROM "features" WHERE ("features"."id" = 2 AND ("features".user_id = 1)) ORDER BY created_at

  def create
    @feature = current_user.features.build(params[:feature])
    if !(@feature.save)
---
INSERT INTO "features" ("created_at", "title", "updated_at", "user_id") VALUES('2010-04-01 17:42:33', 'Authentication', '2010-04-01 17:42:33', 1)

  def edit
    @feature = current_user.features.find(params[:id])
---
SELECT * FROM "features" WHERE ("features"."id" = 2 AND ("features".user_id = 1)) ORDER BY created_at

  def update
    @feature = current_user.features.find(params[:id])
    if @feature.blank? || !(@feature.update_attributes(params[:feature]))
---
SELECT * FROM "features" WHERE ("features"."id" = 2 AND ("features".user_id = 1)) ORDER BY created_at
UPDATE "features" SET "updated_at" = '2010-04-01 17:43:22', "title" = 'Authentication2' WHERE "id" = 2