app/controllers/scenarios_controller.rb

SELECT * FROM "scenarios" WHERE (scenarios.body LIKE '%awesome%') LIMIT 30 OFFSET 0
---
  def index
    # TODO: will_paginate

    if params[:q].present?
      @scenarios = Scenario.body_like(params[:q]).paginate(:page => params[:page] || 1, :per_page => 30)

INSERT INTO "scenarios" ("created_at", "title", "body", "updated_at", "feature_id") VALUES('2010-04-02 23:39:40', 'Kill it with fire.', 'Given i Have fire', '2010-04-02 23:39:40', 3)
---
  def create
    @scenario = @feature.scenarios.build(params[:scenario])
    if !(@scenario.save)

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1 AND ("scenarios".feature_id = 2))
---
  def show
    @scenario = @feature.scenarios.find(params[:scenario_id] || params[:id])

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1 AND ("scenarios".feature_id = 2))
---
  def edit
    @scenario = @feature.scenarios.find(params[:id])

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1 AND ("scenarios".feature_id = 2))
UPDATE "scenarios" SET "updated_at" = '2010-04-03 01:08:57', "body" = 'Given I am awesome
---
  def update
    @scenario = @feature.scenarios.find(params[:id])
    if @scenario.blank? || !(@scenario.update_attributes(params[:scenario]))