app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("salt", "name", "reset_token", "activated_at", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('92db05c5742bed4b7b2081abbf0ae3d243441988', '', NULL, NULL, '2010-04-01 17:39:27', 'f29597bebc1cf2a1f75d16603b7c9897a0d43623', NULL, '2010-04-01 17:39:27', 'cce4e66c4b8d09ffd305237ddef53be8ca4e84f5', NULL, 'eladmeidar', 'elad@eizesus.com')

  def reset_password
    if params[:code].present?
      unless @user = User.find(:first, :conditions => {:reset_token => params[:code]})
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def activation
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = 'cce4e66c4b8d09ffd305237ddef53be8ca4e84f5') LIMIT 1